In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
#importing the data
HR_df = pd.read_csv('https://bit.ly/2ODZvLCHRDataset')
HR_df.head()

   employee_id         department  ... avg_training_score is_promoted
0        65438  Sales & Marketing  ...                 49           0
1        65141         Operations  ...                 60           0
2         7513  Sales & Marketing  ...                 50           0
3         2542  Sales & Marketing  ...                 50           0
4        48945         Technology  ...                 73           0

[5 rows x 14 columns]

In [ ]:
#checking our data
HR_df.shape

(54808, 14)

In [ ]:
#Checking the statistical summary 
HR_df.describe()

        employee_id  no_of_trainings  ...  avg_training_score   is_promoted
count  54808.000000     54808.000000  ...        54808.000000  54808.000000
mean   39195.830627         1.253011  ...           63.386750      0.085170
std    22586.581449         0.609264  ...           13.371559      0.279137
min        1.000000         1.000000  ...           39.000000      0.000000
25%    19669.750000         1.000000  ...           51.000000      0.000000
50%    39225.500000         1.000000  ...           60.000000      0.000000
75%    58730.500000         1.000000  ...           76.000000      0.000000
max    78298.000000        10.000000  ...           99.000000      1.000000

[8 rows x 9 columns]

In [ ]:
#checking the data types
HR_df.dtypes

employee_id               int64
department               object
region                   object
education                object
gender                   object
recruitment_channel      object
no_of_trainings           int64
age                       int64
previous_year_rating    float64
length_of_service         int64
KPIs_met >80%             int64
awards_won?               int64
avg_training_score        int64
is_promoted               int64
dtype: object

In [ ]:
#Encoding the Education column and Gender columns
HR_df["education"] = np.where(HR_df["education"].str.contains("Master's & above", "Bachelor's"), 1, 0)
HR_df["gender"] = np.where(HR_df["gender"].str.contains("m", "f"), 1, 0)
HR_df.head()

   employee_id         department  ... avg_training_score  is_promoted
0        65438  Sales & Marketing  ...                 49            0
1        65141         Operations  ...                 60            0
2         7513  Sales & Marketing  ...                 50            0
3         2542  Sales & Marketing  ...                 50            0
4        48945         Technology  ...                 73            0

[5 rows x 14 columns]

In [ ]:
#checking duplicates
HR_df.duplicated().sum()

0

In [ ]:
#checking for nulls
HR_df.isnull().sum()

employee_id                0
department                 0
region                     0
education                  0
gender                     0
recruitment_channel        0
no_of_trainings            0
age                        0
previous_year_rating    4124
length_of_service          0
KPIs_met >80%              0
awards_won?                0
avg_training_score         0
is_promoted                0
dtype: int64

In [ ]:
#checking for missing data on the prevous_year_rating column
HR_df['previous_year_rating'].unique()

array([ 5.,  3.,  1.,  4., nan,  2.])

In [ ]:
#Picking the value to replace the nan with 
HR_df.groupby('previous_year_rating').employee_id.count()

previous_year_rating
1.0     6223
2.0     4225
3.0    22742
4.0     9877
5.0    11741
Name: employee_id, dtype: int64

In [ ]:
#Counting the number of missing data
HR_df['previous_year_rating'].isna().sum()

4124

In [ ]:
#Replacing the missing data with the mode on the previous_year_rating column
HR_df['previous_year_rating'].fillna(3.0, inplace = True)

In [ ]:
HR_df.head()

   employee_id         department  ... avg_training_score  is_promoted
0        65438  Sales & Marketing  ...                 49            0
1        65141         Operations  ...                 60            0
2         7513  Sales & Marketing  ...                 50            0
3         2542  Sales & Marketing  ...                 50            0
4        48945         Technology  ...                 73            0

[5 rows x 14 columns]

In [ ]:
#dropping the columns we do not need ie department, region,education,gender and recruitment_channel  
# HR_df = HR_df.drop(HR_df.columns['department', 'region', 'gender', 'recruitment_channel'], axis = 1)    
HR_cleandf = HR_df.drop(columns=['employee_id', 'department', 'region', 'recruitment_channel'])  
# df.drop(df.columns[[0, 4, 2]], axis = 1, inplace = True) 
HR_cleandf.head()

   education  gender  ...  avg_training_score  is_promoted
0          1       0  ...                  49            0
1          0       1  ...                  60            0
2          0       1  ...                  50            0
3          0       1  ...                  50            0
4          0       1  ...                  73            0

[5 rows x 10 columns]

In [ ]:
# Data Preparation
feature= HR_cleandf.iloc[:, :-1].values
type(feature_test)

numpy.ndarray

In [ ]:
target= HR_cleandf.is_promoted.values

In [ ]:
# Splitting the Dataset 
from sklearn.model_selection import train_test_split
feature_train, feature_test, target_train, target_test,  = train_test_split(feature, target, test_size=0.2, random_state=0)
# X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=0)

In [ ]:
# Training the Algorithm

#
from sklearn.linear_model import LogisticRegression

# Then train the algorithm
# ---
#
regressor = LogisticRegression()
regressor.fit(feature_train, target_train)

/usr/local/lib/python3.7/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [ ]:
# Making Predictions
y_pred = regressor.predict(feature_test)

In [ ]:
np.shape(y_pred)

(10962,)

In [ ]:
np.unique(y_pred)

array([0, 1])

In [ ]:
#Compare actual output values for feature_test with the predicted values
# df = pd.DataFrame(list, )
df = pd.DataFrame({'Actual': target_test, 'Predicted': y_pred})
df.sample(10)

       Actual  Predicted
3935        1          0
8449        0          0
6686        0          0
8530        0          0
2124        0          0
6131        0          0
10364       0          0
7369        1          0
8658        0          0
3403        0          0

In [ ]:
#Evaluating our model
from sklearn import metrics 
print('Root Mean Squared Error:', np.sqrt(metrics.mean_squared_error(target_test, y_pred)))

Root Mean Squared Error: 0.28780479508336787

In [ ]:
#Checking co-efficient of determiation
print('R Squared:', metrics.r2_score(target_test, y_pred))

R Squared: -0.07631414782453838